var lang={
    sy:["首页","トップページ"],
    gs:["公司概况","会社概况"],
    shiy:["事业内容","事業内容"],
    kf:["开发体制","開発体制"],
    qy:["企业文化","企業文化"],
    lx:["联系我们","アクセス"],
    sy_1:["首页","トップページ"],
    lxwm:["联系我们","アクセス"],
    lxdz:["联系地址","所在地"],
    lxdznr:["公司名称：西安明德软件有限公司　　　　　　　　　　　　　　　　　　　　　　　　"+
    "公司地址：西安市高新技术产业开发区科技二路72号 西安软件园西岳阁406室  \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff"+
    "邮政编码：710075　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　"+
    "电话：029-87607523　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 "+
    "邮箱：info@emdes.com.cn ","会社名称：西安明徳軟件有限公司　　　　　　　　　　　　　　　　　　　　　　　　"+
    "所在地：〒710075　西安高新区科技二路72号西安ソフトウェアパーク西岳閣406室"+
    "TEL：(86)-29-87607523 \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff　\ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff \ufeff"+
    "Email：info@emdes.com.cn"],
    dtdw:["地图定位","アクセスマップ"],
    lxwm_1:["联系我们 |","アクセス |"],
    wzdt:["网站地图 |","サイトマップ |"],
    gr:["个人信息保护","個人情報"],
    qywh:["企业文化","企業文化"],
    gszz:["公司宗旨","会社目的"],
    czgz:["成长规则","社員成長"],
    gshd:["公司活动","会社活動"],
    czgznr:["1、技术培训　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司为新员工进行技术基础培训，让他们尽快地掌握公司的编程规范和工作流程并投入项目开发。 此外公司还定期地举行内部技术交流会和项目交流会，同时不定期地邀请国内外、 公司内外具有资深行业背景和经验的人士来公司举办专业技术讲座，实现技术交流，学习和共享。　　　　　　　　　　　　　　　　　　　　　　　　" +
    "2、日本研修　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司不定期地选派优秀员工和技术骨干到日本总公司参加为期半年或一年的技术研修， 以提高他们的专业技术水平、行业背景等知识。以此来提升公司的核心竞争力。 通过员工的访日研修让员工充分了解日本的历史和文化，加强双方的沟通和理解。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "3、自我投资　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司实行以人为本的管理模式。在公司发展的同时力求发挥每个员工的各种兴趣和特长， 让员工能在公司这个平台上实现自己的梦想。要求每个员工必须不断地进行自我投资。 每半年公司为员工制定一个挑战课题的同时， 要求员工根据自我发展目标制定两个自我发展的挑战课题。公司监督并帮助完成挑战课题。 挑战课题的完成结果和人事考核直接挂钩。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "4、日语培训　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
    "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司要求系统开发人员的日语水平达到三级以上，能读懂日文项目设计书。 要求项目组长的日语水平达二级以上，并能使用日语直接和日本技术人员进行书面沟通和交流。 公司定期开设不同水平的日语程为不同程度员工进行日语培训。 选用来自日本的日语教材和国内的IT专业日语教材，利用多媒体进行教学。"
        ,"1、技術育成　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0自社開発手法及び開発フローを身につけてもらい、新入社員向けて技術育成講座を設けています。 また、社内で定期的に内部の技術、プロジェクト交流会を行われています。　　　　　　　　　　　　　　　　　　　" +
        "2、日本研修　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0会社のコア競争力をあげるため、優秀な技術者を選抜し、日本文化や商習慣を学び、 日本へ研修する機会を設けています。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "3、自己投資　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0会社は技術者を大切にし、技術者各自の趣味、 特長を生かすため、夢のある会社を目指し、プラットフォームを設けています。　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "4、日本語教育　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　" +
        "\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0社内で日本語能力試験合格また日本語コミュニケーションを上達させるよう日本語講座を開設しています。"],
    kftz:["开发体制","開発体制"],
    kfys:["开发优势","得意分野"],
    drkftz:["开发体制","開発体制"],
    byjs:["开发体制","開発体制"],
    kf_1:["注重细节和开发过程的意识改革，持续改善","細部とプロセスを重視し、小さな行動で常に意識改革をし、持続改善を行います"],
    kf_2:["高质量的快速开发体制为客户节约成本","高品質の快速開発体制はコスト節約につながります"],
    kf_3:["结合本社的多年积累为客户提供感动的业务解决方案","本社の数年にわたる積み重ねた経験をいかし、業務ソリューションをお客様に感動させます\n"],
    kf_j_1:["开发语言： Java、.Net、PHP等","開発言語： Java、.Net、PHP等"],
    kf_j_2:["开发工具： Visual Studio、eclipse、Ajax、ActiveReport等","開発ツール： Visual Studio、eclipse、Ajax、ActiveReport等 "],
    kf_j_3:["数据库： SQLServer、Oracle、PostgreSQL、DB2、MySQL等","DB： SQLServer、Oracle、PostgreSQL、DB2、MySQL等 "],
    kf_j_4:["操作系统： Windows、Linux等","OS： Windows、Linux等 "],
    kf_j_5:["其他： Photoshop、CAD等","その他： Photoshop、CAD等 "],
    kf_j_6:["模型搭建： 采用UML建模技术搭建系统模型","UMLの構築 "],
    kf_j_7:["应用领域： 制造、物流、金融、医疗","応用領域： 製造、物流、金融、医療"],
    shiy_1:["事业内容","事業内容"],
    shiy_2:["\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0西安明德软件成立以来，以做客户信赖的外包企业为目标，通过与总公司的提携，致力于为客户提供高品质、短货期、低成本的产品和服务。为了客户、为了地域的软件产业的发展不断地努力奋进。","\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0西安明徳ソフトは日々 、努力を積み重ねており、お客様に信頼されるオフショア企業を目指し、 親会社との連携により、ハイクオリティ・短納期・ローコストの成果物をお客様に提供させて頂きます。 お客様のため、地域のソフトウェア産業活性化のため、多方面のサービスをご提供させて頂きます。"],
    shiy_3:["事业内容","事業内容"],
    shiy_4:["承接面向日本的软件开发和提供相关服务","日本向けのソフトウェア開発の受託業務"],
    shiy_5:["承接各种移行项目的委托开发","各種移行プロジェクトを受託開発する"],
    shiy_6:["承接软件产品的升级改造","保守及びコンサルティングサービスの提供"],
    shiy_7:["面向国内市场的系统集成开发和提供相关服务","中国国内向けのソフトウェア開発の受託業務"],
    xxaq:["信息安全管理","セキュリティ管理"],
    xxaq_a:["加强客户信息管理是企业的义务和责任。","顧客情報管理は企業に重大な責任と義務があります。"],
    pzgl:["品质管理","品质管理"],
    pagl_a:["品质是企业的生命。持续提高技术水平和规范化水平，注重过程监控。","品質は企業の命であり、常にプロセス管理を重視し、標準化、規範化向上に努力します。"],
    gsjj:["\xa0公司简介","\xa0会社概要"],
    gsjj_a:["西安明德软件有限公司是日本EMD公司投资的中国现地法人公司，成立于2008年12月。公司面向日本企业以及中国国内企业提供软件设计开发、技术支持服务、系统维护服务以及咨询服务的高科技公司。","西安明徳軟件有限公司は2008年12月に株式会社ＥＭＤが100％出資の中国現地法人会社で、日本企業及び中国国内企業に向けて、ソフトウェア開発、技術サポート、メンテナンス保守サービス及びコンサルティングを提供する会社です。"],
    xwzx:["\xa0新闻中心","\xa0ニュースセンター"],
    xwzx_a1:["★西安明德软件有限公司的主页改版","★ホームページのリニューアル"],
    xwzx_a2:["★日本岐阜电视台采访株式会社EMD","★日本岐阜テレビ局のインタビュー"],
    xwzx_a3:["★西安明德软件有限公司成立","★西安明徳軟件有限公司設立"],
    jjfa:["\xa0解决方案","\xa0解決案"],
    jjfa_a1:["集团OA办公解决方案","OAシステム解決案"],
    jjfa_a2:["人力资源解决方案","人材解決案"],
    jjfa_a3:["物流仓储解决方案","物流解決案"],
    zgrz:["\xa0资格认证","\xa0会社認証"],
    zgrz_a1:["软件企业认证","ソフトウェア企業認証"],
    zgrz_a2:["技术先进性服务企业认证","技術先進型サービス企業認定証書"],
    gs_1:["公司概况","会社概况"],
    company_1:["公司摘要","会社概要"],
    company_2:["\xa0\xa0\xa0\xa0\xa0\xa0\xa0西安明德软件有限公司是日本EMD公司投资的中国现地法人公司，成立于2008年12月。 公司面向日本企业以及中国国内企业提供软件设计开发、技术支持服务、 系统维护服务以及咨询服务的高科技公司。","\xa0\xa0\xa0\xa0\xa0\xa0\xa0西安明徳軟件有限公司は 2008年12月に株式会社ＥＭＤが100％出資の中国現地法人会社で、 日本企業及び中国国内企業に向けて、ソフトウェア開発、技術サポート、 メンテナンス保守サービス及びコンサルティングを提供する会社です。"],
    company_3:["\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司依托EMD多年来的软件开发经验，目前为多家日本公司提供软件外包开发服务， 其中在制造、流通、医疗、金融等领域的设计开发，博得客户的高度好评。","\xa0\xa0\xa0\xa0\xa0\xa0\xa0株式会社ＥＭＤの 長期にわたるソフトウェア開発のノウハウを受け継ぎ、主に日本企業向けのオフショア開発を承っており、 製造、流通、医療、金融などの領域における実績を築き上げています。"],
    company_4:["\xa0\xa0\xa0\xa0\xa0\xa0\xa0公司秉承“诚实守信、以人为本、切磋琢磨、持续改善”的行动原则， 致力于构筑中日软件开发的桥梁，为客户提供感动的高附加价值的产品和服务。","\xa0\xa0\xa0\xa0\xa0\xa0\xa0西安明徳軟件 有限公司は「誠実、責任、人材を大切、切磋琢磨、持続改善」を行動規則として、 中日ソフト事業の架け橋の役割を果たし、お客様に感動させる高付加価値の製品、 サービスを提供させて頂きます。"],
    gs_2:["公司概况","会社概况"],
    company_5:["公司名称","会社名称"],
    company_6:["西安明德软件有限公司","西安明徳軟件有限公司"],
    company_7:["成立日","設立日"],
    company_8:["2008年12月","2008年12月"],
    company_9:["注册资金","資本金"],
    company_10:["US$100,000","US$100,000"],
    company_11:["公司地址","所在地"],
    company_12:["中国西安高新区科技二路72号西安软件园西岳阁406室","西安高新区科技二路72号西安ソフトウェアパーク西岳閣406室"],
    company_13:["电话","電話番号"],
    company_14:["029-8760-7523","+86-(29)8760-7523"],
    company_15:["关联企业","関連会社"],
    company_16:["东京开发中心","東京開発センター"],
    company_17:["东北支社仙台开发中心","東北支社·仙台開発センター"],
    company_18:["中部支社名古屋开发中心","中部支社名古屋開発センター"],
    company_19:["埼玉开发中心","埼玉開発センター"],
    company_20:["横浜开发中心","横浜開発センター"],
    company_21:["联系我们 |","アクセス |"],
    company_22:["网站地图 |","サイトマップ |"],
    company_23:["个人信息保护","個人情報"],
    pro_1:["个人信息保护","個人情報"],
    pro_2:["个人信息保护","個人情報"],
    protect_1:["西安明德软件有限公司（以下、本公司）严格遵守和执行个人信息安全管理。","西安明徳軟件有限公司（以下、当社）では、個人情報の取り扱いについて、「情報」の安全管理を厳守致します。"],
    protect_2:["\xa0\xa0\xa01、 本公司将以合法公正的方法获取个人信息，明确向客户说明使用客户信息的目的。","\xa0\xa0\xa0\xa01、 当社は個人情報の取得を適法かつ公正な手段により行います。 また、個人情報を取得する場合は、その使用目\xa0\xa0\xa0的を明確にし、利用目的の範囲内で取得致します。"],
    protect_3:["\xa0\xa0\xa02、 本公司为防止信息丢失、泄露等事件发生，会采取严格的信息安全防范措施。","\xa0\xa0\xa0\xa02、 当社は個人情報への不正な紛失、漏えいなどについて適切な管理・監督を行い、安全管理の徹底を図ります。"],
    protect_4:["\xa0\xa0\xa03、 不经客户同意，绝对不向第三方提供任何个人信息。","\xa0\xa0\xa0\xa03、 当社がお客様からご提供頂いた個人情報は、正当な理由がない限り、第三者への提供は致しません。"],
    protect_5:["\xa0\xa0\xa04、 本公司致力于个人信息保护，做到持续改进。","\xa0\xa0\xa0\xa04、 当社は個人情報の保護及び取り扱いについて、事業展開に照らし合わせて、継続的な改善に努めます。"],
    protect_6:["针对本公司的个人信息保护方针以及关于个人信息保护的意见、问题等，请联系我们。","当社の個人情報保護方針あるいは当社保有の個人情報に関するご意見、ご質問がございましたら、 下記のお問い合わせ窓口までご連絡をくださいますようお願いいたします。"],
    protect_7:["Email:info@emdes.com.cn","Email:info@emdes.com.cn"],
    webm_1:["网站地图","サイトマップ"],
    webm_2:["首页:","トップページ:"],
    webm_3:["首页","トップページ"],
    webm_4:["公司概况:","会社概况:"],
    webm_5:["公司概况","会社概况"],
    webm_6:["关联企业","関連会社"],
    webm_7:["公司大事记","会社ニュース"],
    webm_8:["资格认证","会社認証"],
    webm_9:["公司产品","会社製品"],
    webm_10:["事业内容:","事業内容:"],
    webm_11:["事业内容","事業内容"],
    webm_12:["开发体制:","開発体制:"],
    webm_13:["开发体制:","得意分野"],
    webm_14:["对日开发体制","対日開発体制"],
    webm_15:["保有技术","保有技術"],
    webm_16:["开发实绩:","開発実績:"],
    webm_17:["物流运输系统","物流運輸システム"],
    webm_18:["机械工厂网页设计","機械メーカーホームページ"],
    webm_19:["销售MIP系统","販売ＭＩＰシステム"],
    webm_20:["税金系统","税金システム"],
    webm_21:["店铺进销存系统","小売店管理システム"],
    webm_22:["施工系统","施工システム"],
    webm_23:["企业文化:","企業文化:"],
    webm_31:["公司宗旨:","会社目的:"],
    webm_24:["前途发展","前途発展"],
    webm_25:["公司活动","会社活動"],
    webm_26:["联系我们:","所在地:"],
    webm_27:["联系地址","所在地"],
    webm_28:["地图定位","地図の位置"],
    webm_29:["意见建议:","ご意見:"],
    webm_30:["意见建议:","ご意見"],
    advise_1:["公司名称:","貴社名:"],
    advise_2:["姓名:","お名前:"],
    advise_3:["邮箱:","Email:"],
    advise_4:["意见或建议:","ご意見:"],
    advise_5:["验证码:","検証コード:"],
    advise_6:["提交:","提交:"],
    build_1:["详细新闻","詳しいニュース"],
    build_2:["★西安明德软件有限公司成立","★西安明徳軟件有限公司設立"],
    build_3:["发布日期：2008-12-22","発表日：2008-12-22"],
    build_4:["2008年12月 西安明德软件有限公司入驻西安软件园。","二〇〇八年十二月 西安明徳軟件有限公司は西安ソフトウェアパークにて設立致しました。"],
    interview_1:["★日本岐阜电视台采访株式会社EMD","★日本岐阜テレビ局のインタビュー"],
    interview_2:["发布日期：2009-09-10","発表日：2009-09-10"],
    interview_3:["2009年8月，山下社长和李总经理接受日本岐阜电视台采访，参加了该电视台黄金时间播出的《看经济》节目。","二〇〇九年八月 山下社長と李総経理は日本岐阜テレビ局のインタビューを受け、同局の《ビジネスウオッチ》という番組にゲストとして出演致しました。"],
    menorabilia_1:["公司大事记:","会社ニュース:"],
    product_1:["公司产品","会社製品"],
    version_1:["★西安明德软件有限公司的主页改版","★ホームページのリニューアル"],
    version_2:["发布日期：2016-12-09","発表日：2009-09-30"],
    version_3:["2016年12月 西安明德软件有限公司更新了公司网站。","二〇一六年十二月 当社のホームページをリニューアル致しました。"],
},flag=1;
function fds() {
    function f() {
        //debugger;
        var arr=$(".lang");
        /*arr.addClass("aa");*/
        for(var i=0;i<arr.length;i++){
            var id=arr.eq(i).attr("id");
            arr.eq(i).text(lang[id][flag]);
        }
        flag=(++flag)%2;
    }
    f();
}